#변수 


#var 변수명 -- 자바 등 다른 언어 변수라는 것 알려주기 위해서 
#쓰면 변수선언 


#변수명 = 상수를 할당해  
anmimal = "강아지"
name = "해피"
age = 3 
hobby = "산책"
#여어 쓰는ㄴ 것 원칙으로 하자 


print("우리집 강아지는 ", name)


print(" 우리집 강아지는 헤일리 ")
print(" 1.5 살 입니다.")
print(" 우리 ", name, "는 산책을 좋아해요 ")

print("우리", name+ "는 산책을 좋아해요 " )

print (age, "살 입니다")
print(" 우리집 "+anmimal+" " +name)
#변수 : 자료 처리를 위해 이름이 부여된 메모리 공간 

print(" 우리 " + name + "는 " +hobby+ "을 좋아해요 ")

#변수 : 1. 영어  (2. 의미있게 앞으로 어떻게 쓰일지 작명 좋게) 
#규칙 A-Z, a-z, 0-9가능 
#파이썬 대소문자 구분 
#2. 첫글자는 문자여야함, 숫자로 시작할 수 없다.
# 단 예의적으로 _시작 가능  (+, -, *, /, $,@,&, %는 불가)
# 3. 예약어 X  (if, for, while , and, or, ...)- 문법적으로 의미있는 단위 미리 어떤 일 해 시켜놓은 것, 이런 걸로 지어놓으면 컴파일러 헷갈림,  if 반복문 for같은 것  
# 4. 의미있게
# 1. _As99 2. 9ac#wd3 3. AbcdFFsstt99@.@ 4. ssvvkkcc55
#5. 대박 6. 중박 7. 소박(5,6,7 에러는 안남, 쓰지 말자고 했지만) 
#다음중 변수로 사용하기 적합한 것 ? 없음 
#왜? 의미전달 되지 않음 
#. 