#1. 
s = input("문자를 입력하세요.: ")
print(s)
print(s[0]) #s의 첫번째 문자 구하세요. 
for i in s:
    print(ord(i)+3) #한글자 한글자 출력 
m = ord(i)-3
print(chr(m))

#2. score 리스트에 국어 , 영어 , 수학 점수가 들어있다.
# 총점과 평균을 계산해서 리스트에 담은 후 모든
# 학생의 국어, 영어, 수학, 총점, 평균을 출력하시오
# 참고) 리스트에는 국어, 영어 수학 점수만 들어있다.
#1. score 리스트가 이렇게 들어있다. 
score = [
	[80,80,80,0,0],
	[60,50,80,0,0],
	[50,90,90,0,0],
	[40,50,60,0,0],
	[90,90,95,0,0],
	[85,95,100,0,0] ]
# print(score)
#2. 총점과 평균을 계산한다. 
print(score[0]:[2])
# print(s)
# for i in s:
#     print()
# 총점: 80+80+80 
#3. 총점과 평균을 리스트에 담는다. 
# score.append([])
#4. 

#1. score라는 리스트를 만든다. 
#2. score의 총점을 구한다. 
#3. score의 평균을 
#3. 

# 야구 게임 (BaseBall)
# 3자리의 숫자 랜덤 생성 : 397
# 자리와 숫자가 모두 동일 하면 strike
# 자리는 다르지만 다른 자리에 숫자가 존재하면 볼

# 입력:307
# 출력 : 2S

# 입력:379
# 출력: 1S2B

# 입력:397
# 출력: 정답 축하합니다. 3회만에 성공하셨습니다.

# [알고리즘]
# 1. 컴퓨터가 세자리숫자를 생성한다.
# 2. 사용자로부터 3자리숫자를 입력받는다.
# 3. 판별한다.
# 	(자리와 숫자가 일치하면 :strke
# 	자리는다르지만 숫자가일치하면 : ball)
# 4. 출력한다.
# 5. 3strike이면 종료한다.
# 6. 아니면 2번으로 돌아가서 반복한다.


#4. 4.

	# printGuGuDan(2, 6) ; 

	# // 2단 부터 6단까지 출력하는 함수를 구현하세요 
