# # 5*1 = 5
# # 5*2 = **** 
# # 5*3 = 15

# for i in range(1, 10):   
#     if i%2==1:      i가 2로 나눈 몫이 1인지 비교 
#         print("5 *",i,"=",5*i)   맞으면 "5*i" = 5*i로 출력  
#     else:
#         print("5 *",i, "= ****")   아니면 이것 


#5*1 구구단 구하기 
# 홀수만 되게 출력 


# for i in range(1,10):                            # for in , i가 변수  range 1- 10을 i로 
#     print("5*",i, "=", 5*i )                          i가 1이면 5*해서 5*1로 출력 (위의 것해서 출력해라 )
#     if print(i%2=1)


#변하는 부분 변수로 
#안 바뀌는 부분 찾아서 다른 걸로 























#5*1 = 5
#5*2 = 10
# 5 *3 =15

# 1)for i in range(1,10 ): 
    #print("5*",i, "=", 5*i )
    
    
    


# for i in range(1,10 ): 
#     print("5*",i, "=", 5*i )    
#     if i%2==1:
#         print("5*",i, "=", 5*i)
#     else:
#         print("5*",i, "=", "****")



for i in range(1,10): 
    if i%2==1:
        print("5*",i, "=", 5*i)
    else: 
        print("5*",i, "=", "****")


#i를 2로 나눈 것의 나머지 


    #변수 1을 2로 나눈 것이 1일 때 짝수 
